{"data":{"wordpressAcfOptions":{"options":{"tagline":"I’m a Front-end Developer based in <br>San Diego, CA 🏖."}},"allWordpressPost":{"edges":[{"node":{"title":"How to Speed up Search on WordPress site sites with 1,000+ pages","date":"December 03, 2017","content":"<p>WordPress sites can grow really fast, and making sure your search bar can handle large volumes of data can be quite a challenge. In this post, I&#8217;ll give some tips on how to make your wordpress search bar work in large-scale sites.</p>\n<h2 id=\"why-wordpress-sites-slow-down-as-they-grow\">Why WordPress Sites Slow Down as They Grow</h2>\n<p>As your website grows beyond a typical site with a handful of pages to the like of 1,000+ or even 10,000+ pages, your site will inevitably slow down due to a couple of reasons which include: a mishmash of spaghetti code that started to pile up as your code was getting fixed, and Your site having to query through thousands is not millions of lines of the databse.</p>\n<h2 id=\"what-if-you-have-a-site-with-100k-pages\">What if You have a site with 100k+ pages?</h2>\n<p>If you take on client work, you may one day get a client that has a 100k+ page wordpress site that needs to be optimized. Funny thing, that’s exactly what happened to me. Now, if you have a well-coded theme and are one a good host like <a href=\"https://m.do.co/c/73cb4550a3de\" target=\"_blank\" rel=\"noopener\">DigitalOcean</a> (use this link and get $10 credit for free) there shouldn’t be too much of a problem in the trouble happens with the search bar on your site.</p>\n<p>With a site of this scale, wordpress literally has to query through millions of rows in your database to retrieve a specific page your user search for. Luckily, there’s a fix to drastically speed up the search function on your site.</p>\n<h2 id=\"how-to-fix-the-problem-and-speed-up-your-search\">How to Fix The Problem and Speed Up Your Search</h2>\n<p>While wordpress has some great functionalities baked right in, you need to make sure you’re optimizing as much as you can when scaling up. Besides making sure you have a good host, your theme is well-coded, and you’re using a CDN, you should look improving/outsourcing some of the functionality of your site. For the sake of this post, we’re going to talk about using elasticsearch to drastically speed up the search functionality of your site.</p>\n<h3 id=\"elastic-search-can-speed-up-queries\">Elastic Search Can Speed Up Queries</h3>\n<p>Elasticsearch is an open-source, highly scalable search engine that you can use in a variety of applications. The main difference between elasticsearch and a typical wordpress search functionality is that elasticsearch is <em>blazing-fast</em> even at extremely large-scale.</p>\n<h3 id=\"use-elasticpress-plugin\">Use ElasticPress Plugin</h3>\n<p>As with a lot of other solutions, there’s a wordpress plugin for elastic search as well, and it’s called <a href=\"https://www.elasticpress.io/\" target=\"_blank\" rel=\"noopener\">ElasticPress</a>. While I was working on a large scale wordpress project, Tate Lucas of <a href=\"https://dotdash.io/\" target=\"_blank\" rel=\"noopener\">Dot Dash</a> told me about it and implimented into the project. Later that month I spoke at a local Wordcamp, and met Vasken Hauri, the VP of engineering at <a href=\"https://dotdash.io/\" target=\"_blank\" rel=\"noopener\">10Up</a>, the company that created ElasticPress, and spoke with him about it. Since this experience, I’ve been a huge fan of it. (Also, big shout out to Tate: Thanks for bringing me on for hte project! It was great working with you!)</p>\n<p>Simply put, Elasticpress uses <code class=\"highlighter-rouge\">WP_Query</code> to fetch info from elasticsearch instead of the normal MySQL databse it would look at. More simply put, ElasticPress replaces your default wordpress search engine with a better one.</p>\n<h3 id=\"use-search-as-a-service-to-host-your-data\">Use Search as a Service to Host Your Data</h3>\n<p>Now that you’ve got a way to index your searches in a faster method, you need somewhere to store it. This is where a Search as a Service like <a href=\"http://www.searchly.com/\" target=\"_blank\" rel=\"noopener\">Searchly</a> comes in. It powers the backend of your ElasticPress plugin, and even offers analytics, which can be a very powerful tool to help you determine how to better present your data and even better market your product or service. You wouldn’t want to have your cache hosted on the same server your website is on as that would substantially slow down your site (especially if you’re on a shared host).</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>If you’re working on a large-scale wordpress project. Elasticpress and a good Search as a Service tool like are invaluable options to speeding up your search and keeping your users happy.</p>\n<h4 id=\"useful-links\">Useful Links</h4>\n<ul>\n<li><a href=\"https://github.com/elastic/elasticsearch\" target=\"_blank\" rel=\"noopener\">Elastic Search</a></li>\n<li><a href=\"https://www.elasticpress.io/\" target=\"_blank\" rel=\"noopener\">ElasticPress</a></li>\n<li><a href=\"http://www.searchly.com/\" target=\"_blank\" rel=\"noopener\">Searchly</a></li>\n<li><a href=\"https://m.do.co/c/73cb4550a3de\" target=\"_blank\" rel=\"noopener\">DigitalOcean Hosting</a></li>\n</ul>\n"}},{"node":{"title":"Shopify vs. WooCommerce vs. Magento &#8211; Which One Should You Pick?","date":"December 01, 2017","content":"<p>When working on eCommerce projects for clients, it can be a daunting task to figure out which platform to go with. With most of them being so great, it&#8217;s hard to choose.</p>\n<h2 id=\"determine-your-clients-underlying-business-needs\">Determine Your Client’s Underlying Business Needs</h2>\n<p>Before you dive right into the technical details of the projects, you should determine the underlying business goals of your client’s project.</p>\n<p><em>Why</em> do they need this website? Why are they starting now instead of a year ago or a year from now? Is a competitor of there’s doign the same and they want to catch up? Or do they want to keep innovating and figuring out new ways of standing out in the marketplace? These types of questions will help you in creating the right solution for your client.</p>\n<h2 id=\"figure-out-how-they-work-on-maintaining-the-site\">Figure Out how they work on maintaining The Site</h2>\n<p>Look at how your client currently uses either their existing site or other software so you can provide a solution that improves their workflows and not only makes them more money, but cuts down on man-hours spent on tedious tasks that can be automated.</p>\n<h4 id=\"if-your-client-has-an-existing-site\">If Your Client has an Existing Site</h4>\n<p>If your client already has an exisintg eCommerce site (maybe a super old version of Magento underneath a third-party theme), note down how they use that certain CMS, what they like aobut it, what they put up with, essentially, have them user test their current way of maintaing their site.</p>\n<h4 id=\"if-they-dont-have-a-site\">If They Don’t have a Site</h4>\n<p>If they don’t have an existing site, take a look at how they do other stuff around the office, how they manage emails, etc.</p>\n<h3 id=\"find-out-how-they-process-orders\">Find Out How They Process Orders</h3>\n<p>If you can see how your client is currently processing orders, and then tie it together with the processing for the eCommerce store you’re creating, you can save your client a <strong>lot</strong> of headache and money.</p>\n<p>I had a client during the summer of 2017 where I found out they were processing millions of dollars with pink sheets, which were walked over to the desk of the bookkeeper. I was brought on to redesign their online store from an old Magento site to something new and easy-to-use, both for the website visitors, as well as my client. So, having found out about their current way of processing and that they weren’t too tech savy, I suggested we go with shopify, which has a very easy-t-use admin panel, and the ability to create invoices for offline orders. No more writing down credit-card numbers on paper!!</p>\n<h3 id=\"find-out-how-much-maintenance-work-your-client-can-do\">Find Out How Much Maintenance Work Your Client Can Do</h3>\n<p>It’s up to your client to be honest with how much website maintenance work they’re gonna be taking on. Are they comfortable with updating their CMS every so often? Or do the want a “set it and forget it” solution? If they’re comfortable with something more technical, I’d suggest WooCommerce or Magento, but if they want something much more easy to use, I suggest Shopify.</p>\n<h3 id=\"deciding-between-control-and-user-experience\">Deciding Between Control and User Experience</h3>\n<p>The client needs are not the only thing you should be looking at when deciding on an eCommere platform, you should look at your ability and available time as a developer as well.</p>\n<h4 id=\"magento-and-woocommerce\">Magento and WooCommerce</h4>\n<p>Magento and WooCommerce are both open sources platforms that let you go into the backend and give you full control of the payment processing, customer account handling, etc. This can be very powerful, but very dangerous (If you don’t know what you’re doing, you can create some serious problems in payment processing side).</p>\n<p>Additionally, since they’re open source, there isn’t much support your can get outside of forums and stackoverflow. Having said that, the communities for both of these platforms are qutie extensive, and you can find solutions for your problems if you look around more.</p>\n<h4 id=\"shopify\">Shopify</h4>\n<p>Alternatively, Shopify has an amazing platform where you use liquid to call on certain object, leaving the backedn completely untouched. This is a great option for front-end developers like myself, who want to focus on the design and interaction, but it leaves the ability of the platform lacking.</p>\n<p>For instance, you can’t natively create custom fields or post types of even post categories in Shopify. You achieve those things either through paying an additional sum for bloard third-part apps, or not at all.</p>\n<p>However, should you fall into pitfalls, Shopify has a support team you can contact, and in addition, most apps have live chat support as well.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>WooCommerce, Magento, and Shopify are all great platforms and all fit well into the ecosystem. Here are my final thoughts on each:</p>\n<ul>\n<li><strong>Magento:</strong> Built form the ground-up around eCommerce, Magento is one ofthe most powerful platforms for creating an eCommere store that can scale up to enterprise levels. You have near unlimited control of how you want to develop the site, and it’s defintely the most powerful platform of the three I mentioned.</li>\n<li><strong>WooCommerce:</strong> WooCommerce is an open source wordpress plugin that adds eCommerce functionality to WordPress sites, and is a great option to use if you’re already familiar with developing in WordPress. I’m personally not a fan of WooCommerce as it <em>hacks</em>WordPress to be an eCommerce site, but is a solid option nevertheless.</li>\n<li><strong>Shopify:</strong> Shopify is a great platform that gives you a lot of control without having to deal with the backend side of things. This is what I specialize in as most of my clients don’t needs esterprise-level control (Which Shopify Plus would be great for).</li>\n</ul>\n<p>Ultimately, the CMS/Platform you should use depends on your clients needs and your ability as a developer.</p>\n"}}]},"wordpressPage":{"id":"eac0bdfd-bda0-569c-8e4e-7f73b6e91e9a","title":"About","template":"page-about.php","slug":"about","content":"<p>Adam Rasheed is a San-Diego based front-end developer who creates well-designed websites and e-commerce stores. A data nerd at heart, Adam majored in Economics at CSUSB, and has used his data-analysis powers mainly for good. Like many of his generation, he was drawn to coding and design originally as an angsty teen trying to make his MySpace page look cool–but not too cool.</p>\n<p>Since those days he has been pretty busy both in-house and as a freelancer, and with his YouTube channel where he teaches people how to use Sketch. He has a variety of experience such as creating custom WordPress themes, UI design, and speaks fluent HTML, CSS, JavaScript, PHP, and Liquid. (note from editor: one could also add<br />\nsarcasm to that list)</p>\n<p>Adam’s loves to tackle a challenge head-on by analyzing it and coming up with a plan to solve the needs of his clients that makes sense for their big-picture goals. Most recently, he’s working at <a href=\"http://bvaccel.com\">BVAccel</a> as a Front-end Developer in sunny San Diego, and previously, he was a Lead Shopify Developer at <a href=\"https://blenderseyewear.com\">Blenders Eyewear</a>. He’s also taking on select freelance projects. Does your product team<br />\nneed a hand bringing your designs to life? Learn how how you can <a href=\"http://192.241.220.143/freelance/\">hire Adam</a></p>\n<p>Words by <a href=\"https://www.linkedin.com/in/justcallmealyson/\">Alyson Ben-Yehuda</a></p>\n","acf":{"talks":[{"title":"Design for Entrepreneurs","url":"http://csufentrepreneurship.com/tag/csufentrepeneur/","description":"CSUSF Center for Entrepreneurship"},{"title":"Sketch Live Training","url":"https://www.sitepoint.com/a-live-lesson-on-ui-design-with-sketch/","description":"Exclusive training for Sitepoint.com"},{"title":" Using WordPress as a Backend for Your React Project ","url":"https://www.slideshare.net/AdamRasheed3/using-wordpress-as-a-backend-for-your-react-project","description":"San Diego WordCamp 2018"}],"education":[{"title":"UI Design in Sketch Course","url":"https://www.sitepoint.com/designing-custom-icons-in-sketch-3/","description":"Exclusive course for sitepoint.com"},{"title":"SketchVids","url":"http://bit.ly/SketchVids","description":"YouTube channel"}]},"featured_media":{"localFile":{"childImageSharp":{"fluid":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAKABQDASIAAhEBAxEB/8QAGAAAAgMAAAAAAAAAAAAAAAAAAAQBAgP/xAAUAQEAAAAAAAAAAAAAAAAAAAAA/9oADAMBAAIQAxAAAAHKEWSoqH//xAAaEAACAgMAAAAAAAAAAAAAAAAAAQIREjNB/9oACAEBAAEFAs7TtpyI7+I//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAwEBPwE//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAgEBPwE//8QAGxAAAgIDAQAAAAAAAAAAAAAAAAECERAhcZH/2gAIAQEABj8CpDS0K69I9J4//8QAGRAAAwEBAQAAAAAAAAAAAAAAARExABCB/9oACAEBAAE/IQCGzIU4VOgJgFhnwcY3/9oADAMBAAIAAwAAABBTD//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8QP//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQIBAT8QP//EABsQAQEAAgMBAAAAAAAAAAAAAAERACExQWHR/9oACAEBAAE/EG1INJt7jgpuFLQSIvW8NNgyGcuEEWcF9xAMAJ9wk6z/2Q==","aspectRatio":2,"src":"/static/eeb2a4a8e41fdabf3f9d7de7b224cee4-7899e2b5b20547fd6b0ab73aca317e6b-9d093.jpg","srcSet":"/static/eeb2a4a8e41fdabf3f9d7de7b224cee4-7899e2b5b20547fd6b0ab73aca317e6b-daee9.jpg 450w,\n/static/eeb2a4a8e41fdabf3f9d7de7b224cee4-7899e2b5b20547fd6b0ab73aca317e6b-b5cfd.jpg 900w,\n/static/eeb2a4a8e41fdabf3f9d7de7b224cee4-7899e2b5b20547fd6b0ab73aca317e6b-9d093.jpg 1800w,\n/static/eeb2a4a8e41fdabf3f9d7de7b224cee4-7899e2b5b20547fd6b0ab73aca317e6b-acaeb.jpg 2048w","sizes":"(max-width: 1800px) 100vw, 1800px"}}}}}},"pageContext":{"slug":"about"}}