{"data":{"wordpressPost":{"id":"0714f11d-f51c-581b-9efc-1f7f6af5ee7b","title":"Shopify vs. WooCommerce vs. Magento &#8211; Which One Should You Pick?","date":"2017-12-01T04:49:43.000Z","slug":"shopify-vs-woocommerce-vs-magento","content":"<p>When working on eCommerce projects for clients, it can be a daunting task to figure out which platform to go with. With most of them being so great, it&#8217;s hard to choose.</p>\n<h2 id=\"determine-your-clients-underlying-business-needs\">Determine Your Client’s Underlying Business Needs</h2>\n<p>Before you dive right into the technical details of the projects, you should determine the underlying business goals of your client’s project.</p>\n<p><em>Why</em> do they need this website? Why are they starting now instead of a year ago or a year from now? Is a competitor of there’s doign the same and they want to catch up? Or do they want to keep innovating and figuring out new ways of standing out in the marketplace? These types of questions will help you in creating the right solution for your client.</p>\n<h2 id=\"figure-out-how-they-work-on-maintaining-the-site\">Figure Out how they work on maintaining The Site</h2>\n<p>Look at how your client currently uses either their existing site or other software so you can provide a solution that improves their workflows and not only makes them more money, but cuts down on man-hours spent on tedious tasks that can be automated.</p>\n<h4 id=\"if-your-client-has-an-existing-site\">If Your Client has an Existing Site</h4>\n<p>If your client already has an exisintg eCommerce site (maybe a super old version of Magento underneath a third-party theme), note down how they use that certain CMS, what they like aobut it, what they put up with, essentially, have them user test their current way of maintaing their site.</p>\n<h4 id=\"if-they-dont-have-a-site\">If They Don’t have a Site</h4>\n<p>If they don’t have an existing site, take a look at how they do other stuff around the office, how they manage emails, etc.</p>\n<h3 id=\"find-out-how-they-process-orders\">Find Out How They Process Orders</h3>\n<p>If you can see how your client is currently processing orders, and then tie it together with the processing for the eCommerce store you’re creating, you can save your client a <strong>lot</strong> of headache and money.</p>\n<p>I had a client during the summer of 2017 where I found out they were processing millions of dollars with pink sheets, which were walked over to the desk of the bookkeeper. I was brought on to redesign their online store from an old Magento site to something new and easy-to-use, both for the website visitors, as well as my client. So, having found out about their current way of processing and that they weren’t too tech savy, I suggested we go with shopify, which has a very easy-t-use admin panel, and the ability to create invoices for offline orders. No more writing down credit-card numbers on paper!!</p>\n<h3 id=\"find-out-how-much-maintenance-work-your-client-can-do\">Find Out How Much Maintenance Work Your Client Can Do</h3>\n<p>It’s up to your client to be honest with how much website maintenance work they’re gonna be taking on. Are they comfortable with updating their CMS every so often? Or do the want a “set it and forget it” solution? If they’re comfortable with something more technical, I’d suggest WooCommerce or Magento, but if they want something much more easy to use, I suggest Shopify.</p>\n<h3 id=\"deciding-between-control-and-user-experience\">Deciding Between Control and User Experience</h3>\n<p>The client needs are not the only thing you should be looking at when deciding on an eCommere platform, you should look at your ability and available time as a developer as well.</p>\n<h4 id=\"magento-and-woocommerce\">Magento and WooCommerce</h4>\n<p>Magento and WooCommerce are both open sources platforms that let you go into the backend and give you full control of the payment processing, customer account handling, etc. This can be very powerful, but very dangerous (If you don’t know what you’re doing, you can create some serious problems in payment processing side).</p>\n<p>Additionally, since they’re open source, there isn’t much support your can get outside of forums and stackoverflow. Having said that, the communities for both of these platforms are qutie extensive, and you can find solutions for your problems if you look around more.</p>\n<h4 id=\"shopify\">Shopify</h4>\n<p>Alternatively, Shopify has an amazing platform where you use liquid to call on certain object, leaving the backedn completely untouched. This is a great option for front-end developers like myself, who want to focus on the design and interaction, but it leaves the ability of the platform lacking.</p>\n<p>For instance, you can’t natively create custom fields or post types of even post categories in Shopify. You achieve those things either through paying an additional sum for bloard third-part apps, or not at all.</p>\n<p>However, should you fall into pitfalls, Shopify has a support team you can contact, and in addition, most apps have live chat support as well.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>WooCommerce, Magento, and Shopify are all great platforms and all fit well into the ecosystem. Here are my final thoughts on each:</p>\n<ul>\n<li><strong>Magento:</strong> Built form the ground-up around eCommerce, Magento is one ofthe most powerful platforms for creating an eCommere store that can scale up to enterprise levels. You have near unlimited control of how you want to develop the site, and it’s defintely the most powerful platform of the three I mentioned.</li>\n<li><strong>WooCommerce:</strong> WooCommerce is an open source wordpress plugin that adds eCommerce functionality to WordPress sites, and is a great option to use if you’re already familiar with developing in WordPress. I’m personally not a fan of WooCommerce as it <em>hacks</em>WordPress to be an eCommerce site, but is a solid option nevertheless.</li>\n<li><strong>Shopify:</strong> Shopify is a great platform that gives you a lot of control without having to deal with the backend side of things. This is what I specialize in as most of my clients don’t needs esterprise-level control (Which Shopify Plus would be great for).</li>\n</ul>\n<p>Ultimately, the CMS/Platform you should use depends on your clients needs and your ability as a developer.</p>\n"}},"pageContext":{"slug":"shopify-vs-woocommerce-vs-magento"}}