{"data":{"wordpressPage":{"id":"1d924fe9-005b-5b5e-98b4-d9a0304115f9","title":"Freelance","template":"page-freelance.php","slug":"freelance","content":"<h2 id=\"need-some-help-on-a-project-lets-talk\">Need some help on a Project? Let’s talk.</h2>\n<p>For the last 5 years, I’ve been running a small <a href=\"https://creatix.io/\" target=\"_blank\" rel=\"noopener nofollow\">design/development consultancy</a> where I work with small business to help them increase their revenue. Lately, I’ve been working a lot with agencies like <a href=\"https://www.epublishing.com/\" target=\"_blank\" rel=\"noopener\">ePublishing</a> and<a href=\"https://dotdash.io/\" target=\"_blank\" rel=\"noopener nofollow\">Dot Dash</a> to help with their projects. I’d love to work with your’s too!</p>\n<h2 id=\"things-im-good-at\">Things I’m Good at:</h2>\n<ul>\n<li><strong>Effective Communcation.</strong> Seriously, I’ll make sure to understand the needs of the project before taking it on and keep you in the loop throughout the whole project.</li>\n<li><strong>Looking at the underlying business goals at hand.</strong> A lot of times, what the clients really need isn’t what they originally come to your agency for. That‘s where having some solid conversation with them is useful.</li>\n</ul>\n<h2 id=\"things-i-can-help-you-with\">Things I can help you with:</h2>\n<ul>\n<li><strong>Holy Trinity:</strong> HTML, CSS, Javascript. All the things I utilized to build rad MySpace pages in 2006.</li>\n<li><strong>WordPress:</strong> This includes custom themes and large-scale migration and optimization work. PHP and I have become very good friends.</li>\n<li><strong>Shopify:</strong> I started doing custom shopify themes this year, (my favorite on being <a href=\"https://adamrasheed.com/case-studies/flexrake\">Flexrake</a>), and I’m in love with liquid.</li>\n<li><strong>Large-Scale CSS Architecture:</strong> Have a large project you need to make sure doesn’t go awry or have an older site you need to retrofit to into a fully-responsive progressive web app that works on all devices regardless of data speed? I can help using the powers of SCSS and BEM.</li>\n</ul>\n<h2 id=\"things-im-learning\">Things I’m Learning:</h2>\n<ul>\n<li><strong>React:</strong> I’ve been dabbling in small react projects, and recently have started a portfolio piece that uses React in the frontend and hooks up to a wordpress backend through WP’s REST API.</li>\n<li><strong>Progressive Web Apps (PWAs):</strong> I’m learning how important it is to make projects accessible to not only those with disabilities or impairments, but also those without access to high-speed internet or flagship phones. I’m currently learning how to retrofit my past projects into progressive web apps.</li>\n<li><strong>ES7:</strong> Im currently learning Async Await to replace fetch (the way I currently hook into APIs).</li>\n</ul>\n","featured_media":null}},"pageContext":{"slug":"freelance"}}