{"data":{"wordpressPost":{"id":"fab2273f-880b-523b-83e5-af28122c4b82","title":"Creating This Site | Just F***ing Ship","date":"2017-11-27T04:33:25.000Z","slug":"creating-this-site","content":"<p>I&#8217;ve been delaying creating my own personal site that&#8217;s separate from my site I have for small business client work, so I finally made something. Here&#8217;s how I made it.</p>\n<h2 id=\"my-primary-goals\">My Primary Goals</h2>\n<p>While I have a site to market myself to small business clients, I’ve been looking to join an agency or product team in-house, and wanted to showcase my technical chops. So I thought the best way to do that would be two methods: case studies and blog articles where I showcase my experience and share progress on things that I’m learning. So, I created this site.</p>\n<h2 id=\"choosing-a-front-end-framework-that-didnt-get-in-the-way-of-content\">Choosing a Front-end Framework that didn’t get in the way of content</h2>\n<p>Since I’m a developer, I wanted to showcase my techincal ability in making this site, but I also wanted to easily create new case studies and blog articles without putting effort into having to maintain different image sizes, go into the code, etc. I originally chose <a href=\"https://www.gatsbyjs.org/\" target=\"_blank\" rel=\"noopener\">Gatsby</a> a React-based front-end framework (even React’s Offical Docs site uses it!), but I was having some trouble setting up GraphQL (something it uses instead of APIs).</p>\n<h2 id=\"current-tech-stack\">Current Tech Stack</h2>\n<p>For this site, I wanted to launch quickly more than I wanted to get the tech stack just right and humblebrag about using the latest javascript-heavy front-end. So, with a fast launch date in mind, I used the following:</p>\n<h3 id=\"jekyll-static-site\">Jekyll Static Site</h3>\n<p>For this current iteration of the site, I used ol-faithful, Jekyll, a static-site generator I’ve been using for a few years. Jekylls perfect for sites where clients don’t need to go in and change content all too often, and it’s also great for any small side projects you maybe working on. For instance, I used Jekyll to create <a href=\"https://occreative.co/\" target=\"_blank\" rel=\"noopener\">OC Creative</a></p>\n<h3 id=\"gulp-build-tool-to-compile-sass\">Gulp Build Tool to Compile SASS</h3>\n<p>I used Gulp, another tried-and-true build tool, to preprocess and minify my SCSS to minified CSS as well as implement Browsersync so I could look at what I’m coding in real-time. While lately I’ve been using plain NPM scripts as a build tool that processes my code and even Webpack for JS module bundling, I saw ShakyShane’s <a href=\"https://github.com/shakyShane/jekyll-gulp-sass-browser-sync\" target=\"_blank\" rel=\"noopener\">jekyll-gulp-sass-browser-sync</a> Jekyll StarterKit. This alone saves me an hour of setting up a Gulpfile with Jekyll. I simply cloned this repo and I was off to the races. If you want to quickly spin up a jekyll site and want to use SASS, I highly recommend using this repo.</p>\n<h3 id=\"deployed-and-hosted-through-netlify\">Deployed and Hosted Through Netlify</h3>\n<p><a href=\"https://netlify.com/\" target=\"_blank\" rel=\"noopener\">Netlify</a> was the answer to my prayers. It deploy and hosts your code through git pushes. It even has build commands so you can keep your github repo nice and clean, and build a “dist” or in the case of Jekll “_site” folder when you push your code to deploy. Set up if super easy: all you need to do it connect your github account to Netlify and choose the repo you want to use.</p>\n<h2 id=\"future-goals-for-this-site\">Future Goals for This Site</h2>\n<p>This iteration of the site is solid. Besides a few tweaks (peformance, improved design, new icon set), it’s a solid step to help my showcase my work and start blogging more regularly. However, I don’t want this to be a premanent iteration. Below are some things I want to implement on this site. You can also check out the <a href=\"https://trello.com/b/aJBVs9pE\" target=\"_blank\" rel=\"noopener\">Trello Board</a> I created organize the future improvements and blog posts for this site.</p>\n<h3 id=\"improved-design\">Improved Design</h3>\n<p>The design currently is only one color and have little to no design elements in the whole site. Eventually, I want to revisit my Figma file nad tweak the design to be a little less <em>minimalist</em>.</p>\n<h3 id=\"react-front-end\">React Front-end</h3>\n<p>I want to utilize React for a couple of reasons: 1) so I can showcase that I have worked with and shipped react projects before, 2) so I add a lot more interactivty into the site without having the page reload, and 3) speed up the site quite a bit. I’ll most likely use Gatsby once I get the hang of GraphQL, as I haven’t seen anything faster and with a lot of web app capabilities baked in.</p>\n<h3 id=\"wordpress-background\">WordPress Background</h3>\n<p>For a portfolio/blog such as this, WordPress really is the best solution for a backend because of it’s amazing authoring side. It’s built around creating content, and that’s exactly what I’m doing in this site. Plus, WordPress now has a REST API which I can hook up to the React front-end. Nice!</p>\n<h3 id=\"hosted-on-a-vps\">Hosted on a VPS</h3>\n<p>I want to eventually start hosting on a VPS like DigitalOcean, where I host a couple of other sites. In addition to amazing speed, I’ll be able to have complete control over the server environment (which I’ll also get to learn how to do!).</p>\n<h4 id=\"deploy-through-scripts\">Deploy through scripts</h4>\n<p>I want to rely less on third-party services for deploying as I’d like to learn how to do it the proper way. Main benfits would of course be that I’ll be more hire-able, and that I’ll be able to precisely control the deploy conditions I want;</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>While its not exactly what I wanted to use, I’m happy that I wwas able to quickly launch my site using Jekyll, Gulp, and Netlify. I want to make a lot of changes to this site in early 2018, but in the meantime, I’m going to flesh out some more case studies and write a couple of more blog articles. So stay tuned!</p>\n<h4 id=\"useful-links\">Useful Links</h4>\n<ul>\n<li><a href=\"https://www.gatsbyjs.org/\" target=\"_blank\" rel=\"noopener\">GatsbyJS</a></li>\n<li><a href=\"https://github.com/shakyShane/jekyll-gulp-sass-browser-sync\" target=\"_blank\" rel=\"noopener\">Jekyll, Gulp, Sass, Browsersync StarterKit</a></li>\n<li><a href=\"https://netlify.com/\" target=\"_blank\" rel=\"noopener\">Netlify</a></li>\n</ul>\n"}},"pageContext":{"slug":"creating-this-site"}}